wcf/WCFExample/Part6EmployeeWinClient/app_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2018-03-29T17:45:26.4599967Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4a993155-225d-4983-8ff9-b518c6772b10}" /><Execution ProcessName="Part6EmployeeWinClient" ProcessID="6532" ThreadID="1" /><Channel/><Computer>ELEC106725</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2018-03-29T12:45:26.4589966-05:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPozRwUNlaQtxHgkDbl8xaFCkAAAAATcrxqA7r2UmkXS+Mn6Iq8hjoEiY+UwZHqOy9K/5jOSkACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="bf4c3934-1206-4375-8af4-6425a6c5c0d7" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><id>1</id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2018-03-29T17:45:26.4739981Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4a993155-225d-4983-8ff9-b518c6772b10}" /><Execution ProcessName="Part6EmployeeWinClient" ProcessID="6532" ThreadID="1" /><Channel/><Computer>ELEC106725</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2018-03-29T12:45:26.4729980-05:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>572</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Thu, 29 Mar 2018 17:45:26 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:FullTimeEmployee" xmlns:a="http://daynightsoft.com/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/Part6Employee"><a:DateOfBirth>2017-12-12T00:00:00</a:DateOfBirth><a:Gender>Gender 1</a:Gender><a:ID>1</a:ID><a:Name>Name 1</a:Name><a:Type>FullTime</a:Type><b:AnnualSalary>123.123</b:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2018-03-29T17:49:30.9974480Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{a2e778a0-4640-4423-97bd-d51c50295101}" /><Execution ProcessName="Part6EmployeeWinClient" ProcessID="11004" ThreadID="1" /><Channel/><Computer>ELEC106725</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2018-03-29T12:49:30.9964479-05:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo6Em4Pu5SKtKq3ycESJnbz8AAAAAJwOc/EJl8UWRh83bJT8e+7J2/VzCgL5Hvsf2ojUxbewACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="a1cb2d0b-06cf-486a-a9df-68c179c56fbe" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><id>1</id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2018-03-29T17:49:31.0374520Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{a2e778a0-4640-4423-97bd-d51c50295101}" /><Execution ProcessName="Part6EmployeeWinClient" ProcessID="11004" ThreadID="1" /><Channel/><Computer>ELEC106725</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2018-03-29T12:49:31.0374520-05:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>572</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Thu, 29 Mar 2018 17:49:31 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:FullTimeEmployee" xmlns:a="http://daynightsoft.com/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/Part6Employee"><a:DateOfBirth>2017-12-12T00:00:00</a:DateOfBirth><a:Gender>Gender 1</a:Gender><a:ID>1</a:ID><a:Name>Name 1</a:Name><a:Type>FullTime</a:Type><b:AnnualSalary>123.123</b:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>